##
#  Copyrigth (c) 2005-2006 Bursatec. All Rights Reserved.
##

# Archivo de mensajes de error

# Caracteres especiales Unicode
#     \u00e1 -> á
#     \u00e9 -> é
#     \u00ed -> í
#     \u00f3 -> ó
#     \u00fa -> ú
#     \u00f1 -> ñ

# Categoria de errores de java
J0000=Error: {0}.
J0001=Error: No se encontro participante con la clave =[{0}].
J0002=Error: No es posible una divisi\u00f3n entre 0.
J0003=Error: La valuaci\u00f3n debe ser no nula y distinta de cero.
J0004=Error: El usuario del movimiento es requerido.
J0005=Error: El N\u00famero de T\u00edtulos es requerido.
J0006=Error: {0}, contiene un valor invalido.
J0007=Error: El Folio de Llamada es requerido.
J0008=Error: La Cuenta {0} es un campo requerido.
J0009=Error: La Cuenta proporcionada no existe.
J0010=Error: El importe est\u00e1 vac\u00edo o es menor que cero.
J0011=Retiro ya existe con ese folio u Operaci\u00f3n no efectuada, un error no identificado o Fall\u00f3 insert en efectivo del depositante.
J0012=Error: {0}, es(son) campo(s) requerido(s), verifique.
J0013=Error: El Folio de Movimiento es no valido.
J0014=Error: P\u00e1rametros nulos o vac\u00edos.
J0015=Error: CPLEX activo.
J0016=Error: La operacion no puede efectuarse en este horario.
J0017=Error: La operacion no puede efectuarse sobre un registro hist&oacute;rico.
J0018=Error: No se pudo obtener el ID BitacoraOperaciones.
J0019=Error: {0}, tiene(n) un valor NULL o vac\u00edo.
J0020=Error: Se obtuvo un resultado NULL.
J0021=Error: {0} en CPLEX activo.
J0022=Error: Agente Liquidador {0}, no valido.
J0023=Error: Agente No Liquidador {0}, no valido.
J0024=Error: Saldo Disponible insuficiente.
J0025=Error: No se recibi\u00f3 ning\u00fan folio.
J0026=Error: No existe {0}.
J0027=Error: No es posible realizar una operacion de reporto con cuentas de tesoreria.
J0028=Error: Debe seleccionar un tipo de valor {0}.
J0029=ERROR: No se obtuvo folio de confirmacion.
J0030=Error: UNA de las cuentas (la del traspasante \u00f3 la del receptor), DEBE ser de emisi\u00f3n
J0031=Error: No se puede {0} la operaci\u00f3n, ya que esta fue dada de baja.
J0032=Error: El tipo valor es no v\u00e1lido.
J0033=Error: Las cuentas de emisi\u00f3n (5000,5001), no pueden ser utilizadas en operaciones de venta.
J0034=Error: No se puede hacer uso de la cuenta {0}.
J0035=Error: Tipo de solicitud no es segregaci\u00f3n o reconstituci\u00f3n.
J0036=Error: El tipo de valor {0}, no es segregable.
J0037=Error: La cantidad debe de ser mayor o igual a {0}.
J0038=Error: La cantidad no es multiplo de {0}.
J0039=Error: No tiene permiso para realizar la operaci\u00f3n.
J0040=Error: La aplicaci\u00f3n est\u00e1 cerrada.
J0041=Error: No se guardaron los datos en la tabla {0}.
J0042=Error: La fecha es {0} a la fecha actual.
J0043=Error: No se pudo realizar la actualizaci\u00f3n.
J0044=Error: La fecha {0} es {1}.
J0045=Error: El valor de offset debe ser menor a {0}.
J0046=Error: La lista {0} es NULL o esta vacia.
J0047=Error: No se pudo actualizar el registro {0}.
J0048=Error: No se pudo grabar el registro {0}.
J0049=Error: No se pudo borrar el registro {0}.
J0050=Error: La longitud de la cadena {0} no es correcta.
J0051=Error: Formato incorrecto.
J0052=Error: No es posible realizar una operaci\u00f3n de confirmaci\u00f3n en las fases 3,5,7,10,11.
J0053=Error: La cuenta traspasante debe ser de Activos de Sociedades de Inversi\u00f3n.
J0054=Error: La cuenta receptora debe ser de Activos de Sociedades de Inversi\u00f3n.
J0055=Error: Los Traspasos con Sociedades de Inversi\u00f3n solo pueden realizarse en fase 1 y 8.
J0056=Error: No se pueden realizar traspasos a la misma cuenta.
J0057=Error: No es posible realizar traspasos a cuentas de la CCV.
J0058=Error: No es posible enviar la operaci\u00f3n.
J0059=Error: No es posible iniciar la comunicacion con el protocolo.
J0060=Error: Se debe incluir al menos una institucion.
J0061=Error: Emision no valida para efectuar la operaci\u00f3n {0}.
J0062=Error: No se encontr\u00f3 una udi para la fecha proporcionada.
J0063=Error: El valor num\u00e9rico recibido excede el limite v\u00e1lido [valor m\u00e1ximo = {0}].
J0064=Error: El dato recibido no es un valor num\u00e9rico v\u00e1lido. 
J0065=Error: El limite definido para el valor num\u00e9rico excede el permitido para el tipo de dato.  
J0066=Error: No se pueden realizar traspasos a la misma cuenta.
J0067=Error: Falta el precio de adquisici\u00f3n.
J0068=Error: El precio de adquisici\u00f3n no puede ser menor o igual a 0.
J0069=Error al tratar de generar el movimiento.
J0070=Error el estatus es null
J0071=Error al tratar de obtener el Folio Control - status: {0}.
J0072=No existe el instrumento para el tipo de valor dado.
J0073=Ha ocurrido un error inesperado.
J0074=Error: Esta operaci\u00f3n s\u00f3lo es posible con emisiones de mercado de capitales.
J0110=Error: Esta operaci\u00f3n s\u00f3lo es posible con emisiones de mercado de dinero.
J0075=No puede ejecutar la aplicación
J0076=Debe seleccionar una cuenta para las emisiones.
J0077=Error: Emisi\u00f3n no v\u00e1lida para Mercado de {0}.
J0078=Error: El arreglo {0} es NULL o esta vacio.
J0079=Falta el parametro tabla.
J0080=La tabla recibida no es valida.
J0081=No se puede realizar el ordenamiento de la informacion.
J0082=No existe detalle de cobros.
J0083=La lista de par\u00e1metros no puede ser nula.
J0084=No existen datos en la cadena a leer.
J0085=No existen datos de las posiciones.
J0086=No se recibi\u00f3 el mercado.
J0087=La clave reporto no corresponde con una colocaci\u00f3n primaria o recompra.
J0088=El instrumento no es de Mercado de Dinero.
J0089=La fecha del dia no es un dia habil.
J0090=No se ha dado de alta la emisi\u00f3n.
J0091=El uso del instrumento es invalido para esta operaci\u00f3n.
J0092=El instrumento de este papel presenta una excepci\u00f3n.
J0093=La Operacion es solo para papel Gubernamental.
J0094=Las Operaciones con cuentas DIRECTAS, LIBRE SUSCRIP, COBERTURAS No pueden ser Reportos.
J0095=El Papel no es Reportable.
J0096=Solo operaciones Libres de Pago para instituciones distintas a Casas de Bolsa, Bancos, Fideicomiso Banxico y Oper Soc de Inv.
J0097=La Emision NO es Reportable.
J0098=La tenencia del agente no es v\u00e1lida para \u00e9sta operaci\u00f3n.
J0099=La cuenta de los agentes traspasante y receptor no debe ser la misma.
J0100=Error: No fue posible generar el folio control.
J0101=Error: Se requiere el Folio del Prestamo que se va a prorrogar.
J0102=Error: No se permite prorrogar: La hora actual es mayor a la hora m\u00e1xima permitida para prorrogar.
J0103=El plazo es incorrecto - debe ser {0}.
J0104=No existe ningun TV para la consulta.
J0105=Error al intentar obtener los datos del objeto.
J0106=No existe informacion correspondiente al TV proporcionado [ {0} ].
J0107=No se encontro Udi para la fecha [ {0} ].
J0108=La clave reporto no corresponde con una colocaci\u00f3n primaria o recompra.
J0109=El mercado es incorrecto y no se permite grabar el registro.
J0210=No es un depositante valido para Banxico.
J0211=Error: Falta el campo Costo Fiscal Actualizado.
J0212=Error: El campo Costo Fiscal Actualizado no puede ser menor o igual a 0.

J0214=Error: Ya hay un proceso de carga iniciado para este tipo de papel.

J0400=Formato incorrecto en la estructura del registro.
J0401=El campo {0} es requerido.

J0748=Error: No se pudo obtener la referencia del mensaje.

J1000=No es posible efectuar la operacion {0} con la fase [{1}] activa.

J9995=Operaci\u00f3n no soportada.
J9996=El Objeto de par\u00e1metros esta incompleto.
J9997=No hay registros {0} con los parametros seleccionados. 
J9998=No se han encontrado registros para confirmar.
J9999=No se han encontrado registros coincidentes para los criterios de b\u00fasqueda seleccionados.

# Categoria de errores de java (BusinessRules)
JBR-000=Error: {0}.
JBR-105=Error: precio vector es nulo.
JBR-106=Error: La emisi\u00f3n no existe o no est\u00e1 vigente.

JBR-K01 = Error: La instituci\u00f3n {0} no existe.
JBR-K02 = Error: La instituci\u00f3n {0} no cuenta CLABE.
JBR-K03 = Error: La instituci\u00f3n {0} no tiene una cuenta CLABE valida.

JBR-010 = Error: La instituci\u00f3n no tiene clave SPEI.
JBR-011 = Error: La instituci\u00f3n no opera SIAC.
JBR-012 = Error: El Banco Beneficiario debe tener clave SPEI.
JBR-013 = Error: La instituci\u00f3n traspasante no tiene saldo disponible.
JBR-014 = Error: La instituci\u00f3n {0} no tiene cuentas dadas de alta.

JBR-181=Error: La cantidad operada no puede ser mayor al saldo disponible.
JBR-201=Error: Fall\u00f3 update en contadores al incrementar 1.
JBR-202=Error: al modificar el saldo del traspasante.
JBR-203=Error: al modificar el saldo del receptor.
JBR-220=Error: al actualizar sne.
JBR-223=Error: al generar llave_folio para dep_ret_ef
JBR-224=Error: generar el folio.
JBR-225=Error: Entre diferentes instituciones s\u00f3lo se permiten traspasos a sus respectivas cuentas concentradoras.
JBR-226=Error: Para la misma institucion s\u00f3lo se permiten traspasos de capitales y efectivo a la cuenta concentradora.
JBR-300=Error: deadlock victim.
JBR-301=Error: El registro ya existe en mdintran.
JBR-302=Error: Insert mdintran no efectuado por error no identificado.
JBR-308=Error: Precio en cero.
JBR-310=Error: Tipo de operaci\u00f3n inv\u00e1lida.
JBR-313=Error: La cantidad operada debe ser mayor a cero.
JBR-319=Error: La operaci\u00f3n no se compensa ni liquida hoy.
JBR-321=Error: La cuenta debe ser una de las  anteriores.
JBR-325=Error: El plazo de liquidaci\u00f3n debe estar en d\u00edas completos en m\u00faltiplos de 24 hrs.
JBR-367=Error: No est\u00e1 habilitado en tv.
JBR-369=Error: No existe en instrumentos el tv.
JBR-413=Error: Error al calcular el folio.
JBR-438=Error: La confirmaci\u00f3n (en SIDV) est\u00e1 cerrada.
JBR-603=Error: Actualizaci\u00f3n de tabla prestatario.
JBR-612=Error: Vencimiento anticipado, no esta autorizado.
JBR-614=Error: Prestamista no es v\u00e1lido.
JBR-615=Error: No se encontr\u00f3 el prestatario.
JBR-616=Error: Tabla parametros, fallo la consulta.
JBR-618=Error: Prestatario tiene llamada de margen.
JBR-625=Error: La emisi\u00f3n ya venci\u00f3 o no existe el papel.
JBR-632=Error: update en tabla par\u00e1metros.
JBR-633=Error: insert en tabla par\u00e1metros.
JBR-634=Error: No se encontr\u00f3 el precio vector (Vector en nulo o fallo al leer vector1).
JBR-636=Error: al calcular la valuaci\u00f3n.
JBR-649=Error: Restriccion del 7% incumplida.
JBR-650=Error: Restriccion del 3% incumplida.
JBR-652=Error: Pr\u00e9stamo no puede vencer mismo d\u00eda o antes.
JBR-653=Error: Pr\u00e9stamo mayor al plazo m\u00e1ximo de pr\u00e9stamo en d\u00edas naturales.
JBR-654=Error: Pr\u00e9stamo no puede vencer en d\u00eda inh\u00e1bil.
JBR-656=Error: Pr\u00e9stamo no puede vencer el mismo d\u00eda  o despu\u00e9s de la fecha de vencimiento de la emisi\u00f3n.
JBR-657=Error: al leer fecha de vencimiento del papel.
JBR-658=Error: Vencimiento mayor a 2 d\u00edas h\u00e1biles antes de vencer la emisi\u00f3n.
JBR-659=Error: Lectura de plazo m\u00e1ximo en par\u00e1metros.
JBR-660=Error: Tasa P tiene un valor no v\u00e1lido.
JBR-661=Error: Tasa T tiene un valor no v\u00e1lido.
JBR-663=Error: Colateral tiene un valor no v\u00e1lido.
JBR-664=Error: Aforo inv\u00e1lido.
JBR-665=Error: al calcular premio.
JBR-667=Error: al insertar en pr\u00e9stamos.
JBR-668=Error: Pr\u00e9stamo no puede ser mayor al saldo en valores.
JBR-674=Error: Actualizaci\u00f3n de tabla pr\u00e9stamo.
JBR-675=Error: El pr\u00e9stamo no existe o no cumple las condiciones.
JBR-680=Error: La operaci\u00f3n debe ser "D" o "R".
JBR-681=Error: Instrumento desconocido.
JBR-682=Error: La garant\u00eda es insuficiente.
JBR-683=Error: Lectura de tabla pr\u00e9stamo.
JBR-685=Error: Sobretasa tiene un valor no v\u00e1lido.
JBR-686=Error: Tasa I tiene un valor no v\u00e1lido.
JBR-694=Error: Actualizaci\u00f3n de tabla garant\u00edas.
JBR-691=Error: El pr\u00e9stamo no est\u00e1 valuado.
JBR-692=Error: No se encontr\u00f3 el registro en tabla garant\u00edas.
JBR-693=Error: Inserci\u00f3n en tabla garant\u00edas.
JBR-694=Error: Actualizaci\u00f3n de tabla garant\u00edas.
JBR-695=Error: No es posible verificar el valor.
JBR-996=Error: La cantidad no puede ser igual a cero.
JBR-997=Error: al ejecutar SP interno.
JBR-999=Error: Par\u00e1metros incompletos o incorrectos.


# Categoria de errores de ambiente
A0001=Por el momento no se encuentra disponible el servidor, intente mas tarde.

# Categoria de errores de SPs
-100=Se genera un corto en valores.
-106=La emision no existe o no esta vigente.
-108=Hubo error en la base de datos mdintran.
-109=No se encuentra el registro con el folio que se recibio.
-111=ERROR!!!
-118=No existe cuenta de Propios o Terceros para vendedor.
-119=No existen registros en la vista o No existe cuenta de Propios o Terceros para comprador.
-120=Estatus de operaci\u00f3n erroneo para efectuar el deposito o retiro de efectivo.
-131=Saldo disponible a cero.
-140=Retiro ya existe con ese folio en dep_ret_garan o Operaci\u00f3n no efectuada, un error no identificado o Fallo insert en valores del depositante.
-141=No existen registros en dep_ret_garan con el folio.
-142=No existen registros en dep_ret_ef con el folio.
-143=La emision tiene problemas.
-144=Error no identificado.
-146=No se encontro la info en dep_ret_ef.
-147=Ya existe el folio control en traspasos.
-150=Registro no actulizado por error no identificado.
-152=Saldo no actualizado de saldos_efectivo.
-156=Tipo de operacion invalida.
-161=Error: al actualizar valor cartera o No existe cuenta en agentes.
-166=Error: al actualizar SD en valores Trasp.
-167=Error: al actualizar SD en valores Recep.
-168=No existen registros en valuacion_bm.
-170=Registro no creado, error no identificado. Error al act el valor de cartera del comp.
-172=No se inserto en dep_ret_garan.
-174=Error: el convertir importe char a numeric.
-175=Error: al obtener el saldo_traspasante.
-176=Folio confirmacion duplicado.
-178=El sistema se encuentra cerrado.
-179=Error al obtener el saldo_ini_receptor.
-180=importe (convert a numeric) no ser <= 0.
-181=Error: No actualizo correcto al trasp o recep.
-182=Error: al obtener el saldo_fin_traspasante.
-183=Error: al obtener el saldo_fin_receptor.
-184=Error: No existe registro contable en trspefec.
-186=No se encontr\u00f3 cuenta Operada por Bolsa.
-187=No se encontr\u00f3 cuenta Propia.
-196=Error: al dar alta en dep_ret_ef.
-199=Error: no identidicado o Fallo update en contadores al incrementar 1.
-200=Fallo update en contadores al incrementar 1.
-201=Fallo update en contadores al incrementar 1.
-202=Error: al actualizar el saldo disponible del agente.
-203=Error: al actualizar el saldo del receptor.
-205=Traspaso no efectuado error no identificado.
-209=Error: al actualizar baja trspefec.
-210=No hay informacion en traspasos.
-211=No hay informacion en temp_trasp.
-220=Error: al actualizar sne.
-223=Error: al gen llave_folio para trspefec.
-226=Error: no identificado. Error al insertar en trspefec.
-227=No se encontraron registros en la carga POSVAL o Error: colateral insuficiente.
-228=El sistema se encuentra cerrado o Error: Liquidacion CCV en proceso.
-229=Error: al actualizar saldos_efectivo traspasante.
-230=Error: al leer la  informacion. Error act saldos_efectivo receptor.
-231=El procoval esta activo.
-234=Error: Saldo insuficiente.
-236=Error: Fallo lectura procesos CCV.
-237=Error: En lectura empresascat.
-250=Error miscelaneo de select.
-259=Suspensi\u00f3n temporal.
-300=Error: Deadlock victim o Tipo deposito/liquidacion invalido.
-301=Error: El registro ya existe en mdintran.
-303=Error: Update knetos no efectuado por error no identificado.
-302=El folio banxico ya existe o Insert mdintran no efectuado por error no identificado.
-319=La operacion se compensa y liquida a futuro.
-321=Error al calcular folio del deposito.
-354=El folio banxico ya existe.
-356=Error: al insertar registro de deposito.
-357=Folio recibido es nulo.
-412=Error: al calcular el folio.
-438=La confirmaci\u00f3n (EN SIDV) esta cerrada.
-450=No se encontraron garant\u00edas en vencimiento.
-457=El sistema se encuentre cerrado para la aplicaci\u00f3n: UP_flujo [return status = -457].
-458=No se encontraron datos en la b\u00fasqueda [return status = -458].
-459=No se encontraron datos en la b\u00fasqueda [return status = -459].
-499=Fall\u00f3 al insertar en tabla de par\u00e1metros o No se encontr\u00f3 garant\u00edas.
-500=Entre a error de parms_gar  o Entre al error de l\u00ednea o Error: al obtener el saldo de otras cuentas.
-580=La tabla enviada como parametro no existe.
-600=Error: al dar de alta al prestamista o Error no identidicado.
-601=Error: al dar de alta al prestatario.
-602=Error: al actualizar prestamista.
-603=Error: Actualizaci\u00f3n de tabla prestatario.
-604=Error: S\u00f3lo existe funci\u00f3n 1 y funci\u00f3n 0.
-605=Error: S\u00f3lo existe la acci\u00f3n A o la acci\u00f3n B o Error: par\u00e1metro accion debe ser A o B.
-606=Error: Baja imposible, el registro no existe.
-607=Error: Actor existe pero no tiene cuenta.
-609=Error: Fallo inserci\u00f3n en insgar.
-610=Error: Fallo borrado en insgar.
-611=Error: no existe el registro.
-612=Error: Vencimiento anticipado, no esta autorizado.
-613=Error: La funci\u00f3n debe ser P, G o AM.
-614=Error: Prestamista no existe.
-615=Error: Prestatario no existe.
-616=Error: Tabla parametros, fallo la consulta.
-618=Error: Prestatario tiene llamada de margen.
-619=Error: Fallo actualizar en tasas.
-620=Error: Fallo inserci\u00f3n en tasas.
-621=Error: Fallo inserci\u00f3n o actualizaci\u00f3n de vector1.
-623=Error: en alta publicada.
-624=Error: No existe cuenta en prestamistas.
-625=Error: No existe la emisi\u00f3n. La emision ya vencio o no existe el papel.
-626=Error: No se permite prestar ese tipo de valor.
-627=Error: Al calcular folio del deposito.
-628=Error: El folio banxico ya existe.
-629=Error: Al actualizar el saldo de valores.
-630=Error: Al insertar el registro en valores.
-631=Error: No existe la cuenta en agentes o al insertar registro de deposito.
-632=Error: Fallo update en tabla par\u00e1metros.
-633=Error: Fallo insert en tabla par\u00e1metros.
-634=Error: Vector en nulo o al leer vector1.
-635=Error: Al obtener los status de los prestamos.
-637=Error: No existe informaci\u00f3n de traspasos.
-639=Error: No se permite otro tipo de movimiento.
-644=Error: Fecha de liquidaci\u00f3n meno que hoy.
-645=Error: Folio en prestamo no existe o no es valido.
-646=Error: Prestamista no corresponde a prestamo.
-647=Error: Prestatario no corresponde a prestamo.
-649=Error: Restriccion del 4% incumplida.
-650=Error: Restriccion del 3% incumplida.
-652=Error: Prestamo no puede vencer mismo dia o antes.
-653=Error: Prestamo mayor al plazo maximo de prestamo en dias naturales.
-654=Error: Prestamo no puede vencer en dia inhabil.
-656=Error: Prestamo no puede vencer el mismo dia o despues de la fecha de vencimiento de la emision.
-657=Error: al leer fecha de vencimiento del papel.
-658=Error: Vencimiento mayor a 2 dias habiles antes de vencer la emision.
-659=Error: Lectura de plazo maximo en parametros.
-660=Error: Tasa P tiene un valor no valido.
-661=Error: Tasa T tiene un valor no valido.
-663=Error: colateral tiene un valor no valido.
-664=Error: Aforo invalido.
-665=Error: al calcular premio.
-667=Error: al insertar en prestamos.
-668=Error: Saldo disponible. Prestamo no puede ser mayor al saldo en valores.
-669=Error: No hubo informaci\u00f3n en la cuenta pool.
-671=Error: No hubo informaci\u00f3n en vptran.
-672=Error: No se actualiz\u00f3 la tabla de traspasos.
-674=Error: Actualizaci\u00f3n de tabla eprestamo.
-675=Error: No hubo informaci\u00f3n de prestamos a vencer.
-676=Error: No se actualiz\u00f3 la tabla vptran.
-678=Error: al actualizar valores.
-679=Error: al insertar traspaso.
-681=Error: Instrumento desconocido.
-682=Error: La garantia es insuficiente.
-683=Error: Prestamo no existe o no cumple las condiciones.
-684=Pr\u00e9stamo pendiente por valores y/o efectivo.
-685=Error: Sobretasa tiene un valor no valido.
-686=Error: Tasa I tiene un valor no valido.
-687=Error al insertar en vptran.
-800=El sistema se encuentra cerrado.
-801=No se han confirmado todos los registros de capitales.
-802=Error: al ejecutar el SP.
-997=Error: ejecucion de SP interno.
-998=Error: Desbordamiento num\u00e9rico.
-999=Error: Par\u00e1metros incorrectos.

#adgpm041 Errores en el storedprocedure bdcamara..adgpm041 // Deposito Valores
#adgpm042 Errores en el storedprocedure bdcamara..adgpm042 // Deposito Efectivo
bdcamara..adgpm042-6=Error:No se proporciono el parametro de retorno al SP.
bdcamara..adgpm042-100=Se genera un corto en valores.
bdcamara..adgpm042-101=No se pudo dar de alta el receptor en valores.
bdcamara..adgpm042-102=Error: en UP_uverdin valores traspasante.
bdcamara..adgpm042-104=Error: en UP_gl_cvalcar, o Error valores en garantia por colateral.
bdcamara..adgpm042-161=Error: al actualizar el valor de cartera del vend.
bdcamara..adgpm042-170=Error: al actualizar el valor de cartera del comp.
bdcamara..adgpm042-175=Error: al obtener el saldo_traspasante.
bdcamara..adgpm042-179=Error: al obtener el saldo_ini_receptor.
bdcamara..adgpm042-181=Error: No actualizo correcto al trasp o recep.
bdcamara..adgpm042-182=Error: Al obtener el saldo_fin_traspasante.
bdcamara..adgpm042-183=Error: Al obtener el saldo_fin_receptor.
bdcamara..adgpm042-184=Error: No existe registro contable en trspefec.
bdcamara..adgpm042-202=Error al actualizar el saldo del traspasante.
bdcamara..adgpm042-203=Error al actualizar el saldo del receptor en SIDV.
bdcamara..adgpm042-205=Error saldo_disponible.
bdcamara..adgpm042-227=Error: colateral insuficiente  o Error al insertar en trspefec.
bdcamara..adgpm042-228=Error: Liquidacion CCV en proceso.
bdcamara..adgpm042-234=Error: saldo insuficiente.
bdcamara..adgpm042-236=Error: lectura procesos CCV.
bdcamara..adgpm042-237=Error: En lectura empresascat.
bdcamara..adgpm042-319=Error: La cuenta del vendedor no existe.
bdcamara..adgpm042-500=Error: al obtener el saldo de otras cuentas.
bdcamara..adgpm042-501=No se encontro el precio de la emision para su valuacion.
bdcamara..adgpm042-502=Error: en UP_permiso.
bdcamara..adgpm042-503=Error: en UP_version.
bdcamara..adgpm042-504=Error: en UP_permiso para el comprador.
bdcamara..adgpm042-505=Error: en UP_uversion para empresascat.
bdcamara..adgpm042-999=Error: Faltan parametros.
bdcamara..adgpm042-1101=ERROR: en el foliador de movimientos.
bdcamara..adgpm042-1102=Error: al obtener ge_bd_catalogo en CPARAMETRO.
bdcamara..adgpm042-1103=ERROR: al actualizar KEDO_EFECTIVO cuando existe un registro para el d\u00eda de hoy.
bdcamara..adgpm042-1104=ERROR: al actualizar KEDO_EFECTIVO el indicador GE_ACTUAL del registro del d\u00eda anterior.
bdcamara..adgpm042-1105=ERROR: al insertar KEDO_EFECTIVO.
bdcamara..adgpm042-1106=ERROR: al insertar KMOV_EFECTIVO.
bdcamara..adgpm042-1107=ERROR: al actualizar KLLAMADAS.
bdcamara..adgpm042-1108=ERROR: al actualizar KLLAMADAS.
bdcamara..adgpm042-1109=ERROR: al actualizar a CUB la llamada.
bdcamara..adgpm042-1110=ERROR: en el traspaso de efectivo a SIDV.

#adgpm201 Errores en el storedprocedure bdcamara..adgpm201 // Retiro Valor
#adgpm202 Errores en el storedprocedure bdcamara..adgpm202 // Retiro Efectivo
bdcamara..adgpm202-1=Error en la ejecucion!!!

#UP_tranmcap  Errores en el store bdcaptal..UP_tranmcap
bdcaptal..UP_tranmcap-313=La cantidad operada debe ser mayor a cero.
bdcaptal..UP_tranmcap-310=Tipo de operacion invalida.
bdcaptal..UP_tranmcap-325=Pzo liq debe ser dias completos en multiplos de 24 horas.
bdcaptal..UP_tranmcap-308=Precio en cero.
bdcaptal..UP_tranmcap-319=La operacion no se compensa ni liquida hoy.
bdcaptal..UP_tranmcap-105=precio vector es nulo.
bdcaptal..UP_tranmcap-106=La emision no existe o no esta vig.
bdcaptal..UP_tranmcap-321=La cta traspasante debe ser PROP o TERC y la cuenta receptora debe ser PROP, TERC,CGAR o MDER.
bdcaptal..UP_tranmcap-413=Error: al calcular folio.
bdcaptal..UP_tranmcap-181=Saldo no disponible para la operaci\u00f3n.
bdcaptal..UP_tranmcap-182=Saldo no disponible para la operaci\u00f3n.
bdcaptal..UP_tranmcap-999=Error: Par\u00e1metros incorrectos.

#UP_trasp_divint Errores en el storedprocedure bdcaptal..UP_trasp_divint
bdcaptal..UP_trasp_divint=Error: El SP lanz\u00f3 un codigo de error.
bdcaptal..UP_trasp_divint-999=Error de parametros.
bdcaptal..UP_trasp_divint-996=Error de parametros.
bdcaptal..UP_trasp_divint-12=Error al ejecutar bdcaptal..UP_uvercap.
bdcaptal..UP_trasp_divint-13=Error al ejecutar bdcaptal..UP_altavalc.
bdcaptal..UP_trasp_divint-202=Traspaso no efectuado error no identificado.
bdcaptal..UP_trasp_divint-203=Error al efectuar update en valores.
bdcaptal..UP_trasp_divint-181=Error saldo_disponible < cantidad_operada.
bdcaptal..UP_trasp_divint-14=Error al ejecutar bdcaptal..UP_altavalc.
bdcaptal..UP_trasp_divint-204=Error al actualizar el saldo del fideicomiso.
bdcaptal..UP_trasp_divint-147=Ya existe el folio control en traspasos.

#UP_trasp_divintsf Errores en el storedprocedure bdcaptal..UP_trasp_divintsf
bdcaptal..UP_trasp_divintsf=Error: El SP lanz\u00f3 un codigo de error.
bdcaptal..UP_trasp_divintsf-999=Error de parametros.
bdcaptal..UP_trasp_divintsf-996=Error de parametros.
bdcaptal..UP_trasp_divintsf-181=Error saldo_disponible < cantidad_operada.
bdcaptal..UP_trasp_divintsf-12=Error al ejecutar bdcaptal..UP_uvercap.
bdcaptal..UP_trasp_divintsf-13=Error al ejecutar bdcaptal..UP_altavalc.
bdcaptal..UP_trasp_divintsf-202=Traspaso no efectuado error no identificado.
bdcaptal..UP_trasp_divintsf-147=Ya existe el folio control en traspasos.
bdcaptal..UP_trasp_divintsf-205=Traspaso no efectuado error no identificado.

# Errores en el soterdprocedure bddinero..UP_altamdin
bddinero..UP_altamdin-301=Error: El registro ya existe en mdintran.
bddinero..UP_altamdin-302=Insert mdintran no efectuado por error no identificado.

# Errores en el storedprocedure catalogo..UP_libera_city
catalogo..UP_libera_city-202=Traspaso no efectuado error no identificado.
catalogo..UP_libera_city-203=Error al actualizar el saldo del receptor.
catalogo..UP_libera_city-147=Ya existe el folio control en traspasos.
catalogo..UP_libera_city-206=Modificaci\u00f3n de estatus no efectuada.
catalogo..UP_aplicacion-300=No existe la aplicaci\u00f3n 
