##
#  Copyrigth (c) 2005-2006 Bursatec. All Rights Reserved.
##

# Archivo de mensajes de error

# Caracteres especiales Unicode
#     \u00e1 -> \u00e1
#     \u00e9 -> \u00e9
#     \u00ed -> \u00ed
#     \u00f3 -> \u00f3
#     \u00fa -> \u00fa
#     \u00f1 -> \u00f1

# Categoria de errores de java
J0000=Error: {0}.
J0001=Error\: Emisi\u00F3n inv\u00E1lida.
J0002=Error: Fallas al obtener la secuencia.
J0003=Error\: El agente {0} no es v\u00E1lido.
J0004=Error\: La cantidad de t\u00EDtulos no puede ser menor o igual a cero (0).
J0005=Error\: No ha sido posible grabar la informaci\u00F3n en BitacoraOperaciones.
J0006=Error: Falta fecha inicial.
J0007=Error: Falta fecha final.
J0008=Error\: Cuenta nombrada inv\u00E1lida.
J0009=Error\: El tipo de cuenta para operaci\u00F3n SIC solo puede ser SICP o SICT.
J0010=Error\: El tipo de operaci\u00F3n es incorrecto.
J0011=Error: El tipo de traspaso es incorrecto.
J0012=Error\: El custodio no es v\u00E1lido para esta operaci\u00F3n.
J0013=Error: Los arreglos {0} y {1} son de longitudes diferentes.
J0014=Error: No se puede usar el custodio en contrapago.
J0015=El servicio no est\u00E1 disponible actualmente. Por favor, intente m\u00E1s tarde.
J0016=Error: La fecha final no debe ser menor a la final.
J0017=Error\: Tipo de traspaso inv\u00E1lido; debe ser TLP (Libre de Pago) o TCP (Contrapago).
J0018=Error\: Tipo de operaci\u00F3n inv\u00F3lido; debe ser E (Entrega) o R (Recepci\u00F3n).
J0019=Error\: No tiene saldo la emisi\u00F3n.
J0020=Error: No se pudo grabar el registro en {0}.
J0021=Error: La lista de registros no debe ser mayor a un elmento.
J0022=Error: No existe el traspasante.
J0023=Error\: La cuenta traspasante no es v\u00F3lida. 
J0024=Error\: La fecha de notificaci\u00F3n debe ser la actual.
J0025=Error\: Error en la conversi\u00F3n de la fecha de notificaci\u00F3n.
J0026=Error: No existe {0}.
J0027=Error\: La fecha de liquidaci\u00F3n debe ser d\u00EDa h\u00F3bil.
J0028=Error\: Error en la conversi\u00F3n de la fecha de liquidaci\u00F3n.
J0029=Error\: La fecha de operaci\u00F3n debe ser d\u00EDa h\u00F3bil.
J0030=Error\: Error en la conversi\u00F3n de la fecha de operaci\u00F3n.
J0031=Error\: La fecha de operaci\u00F3n debe ser menor o igual a la fecha de liquidaci\u00F3n.
J0032=Error: La cantidad operada debe ser mayor a cero (0).
J0033=Error: El importe y la divisa son requeridos.
J0034=Error: El importe debe ser mayor a cero (0).
J0035=Error con la divisa.
J0036=Error con el custodio.
J0037=Error: No se puede usar el custodio en contrapago.
J0038=Error con el depositante.
J0039=Error\: No se pueden traspasar titulos de otra instituci\u00F3n.
J0040=Error: No fue posible obtener la cuenta receptora.
J0041=Error: Falta la fecha de consulta.
J0042=Error\: Custodio inv\u00F3lido.
J0043=Error\: Depositante inv\u00F3lido.
J0045=Error: El valor de offset debe ser menor a {0}.
J0046=Error\: La lista {0} es NULL o esta vac\u00EDa.
J0047=Error\: El arreglo {0} es NULL o esta vac\u00EDo.
J0048=Error\: La cadena {0} es NULL o esta vac\u00EDa.
J0049=Error: No se pudo borrar el registro {0}.
J0050=Error\: La Boveda no es v\u00F3lida.
J0051=Error\: Formato incorrecto 
J0052=Error\: El estatus de la operaci\u00F3n es inv\u00F3lido.
J0053=Error\: {0} es NULL o vac\u00EDo.
J0054=Error\: El agente no tiene una clave v\u00E1lida.
J0055=Error\: Los siguientes par\u00E1metros son requeridos\: {0}
J0056=Error\: Instituci\u00F3n no existe. (Id\: "{0}", Folio\: "{1}")
J0057=Error: Cuenta nombrada no existe. (Id: "{0}", Folio: "{1}", Cuenta: "{2}")
J0058=Error: Custodio no existe. (Id: "{0}", Folio: "{1}", Cuenta: "{3}")
J0059=Error: No se puede eliminar el custodio, {0}.
J0060=Error: Agente desconocido. Valores esperados: {0}.
J0061=Error: La cuenta "{0}" no tiene prefijo(s) "{1}", o sufijo(s) "{2}".
J0062=Error\: Para Personas F\u00EDsicas de EUA solo puedes escoger Individual/Sole proprietor
J0063=Error: Para Personas Morales de EUA solo puedes escoger Corporation o Limited Liability Company
J0064=Error: Para Personas Morales de EUA el valor Exempt payee debe estar marcado
J0065=Error\: Para Personas F\u00EDsicas de EUA debe capturar el SSN
J0066=Error: Para Personas Morales de EUA debe capturar el Employer identification number
J0067=Error: Formato de SSN incorrecto, debe de tener el siguiente formato 123-45-6789
J0068=Error: Formato de Employer identification number incorrecto, debe de tener el siguiente formato 12-3456789
J0069=Error\: El formato del beneficiario no existe \u00F3 no esta activo o vencido
J0070=Error\: Este formato ya esta asignado a esta instituci\u00F3n. 
J0071=Error: El campo Capacity in which acting no puede contener las palabras LEGAL, APODERADO o REPRESENTANTE
J0072=Error: El Beneficiario ya esta activo
J0073=Error: El Beneficiario no existe
J0074=Error: El Beneficiario ya esta cancelado
J0075=Error\: Fecha de Formato Inv\u00E1lida.
J0076=Error: El campo Tax Classification solo puede contener C, S o P.
J0077=Error: El ADP no puede ser mayor de 10 caracteres
J0078=Error\: Esa instituci\u00F3n no esta asignada al usuario.
J0079=Error\: El Tipo Valor de la emisi\u00F3n debe ser 1A o 1I.
J0080=Error\: La Serie de la emisi\u00F3n debe ser (*).
J0081=Error: El formato debe ser W8BEN, W8IMY O W9.
J0082=Error\: El objeto Emisi\u00F3n no fue encontrado.
J0087=Posici\u00F3n actual en ceros.
J0090=Error\: La fecha de liquidaci\u00F3n  no puede ser mayor a 8 d\u00EDas h\u00E1biles
J0091=Error\: La fecha de liquidaci\u00F3n no puede ser menor a la fecha actual.
J0092=Error\: La fecha de operaci\u00F3n no puede ser menor a la fecha actual.
J0093=Error\: La fecha de notificaci\u00F3n no puede ser menor a la fecha actual.
J0094=Error\: La fecha de liquidaci\u00F3n no puede ser mayor a la fecha actual.
J0095=Error\: S\u00F3lo est\u00E1n permitidas Cuentas Propias y de Terceros.
J0096=Error\: La fecha de liquidaci\u00F3n debe ser la fecha actual.
J0097=Error\: {0}, no debe iniciar con gui\u00F3n bajo.
J0098=Error\: El nombre del Archivo es NULL.
J0099=Error\: No exite el Registro o el Usuario.
J0100=Error\: La cantidad ingresada no puede ser mayor a 100.
J0101=Error\: El estado del Beneficiario no es Autorizado.

J0102=Error\: Para personas morales de EUA debe seleccionar una opci\u00F3n exento de pago.
J0103=Error\: Para personas morales de EUA debe seleccionar una opci\u00F3n c\u00F3digo de reporte FATCA
J0104=Error\: Debe seleccionar si el beneficiario esta activo o inactivo
J0105=Error\: {0} es nulo o vac\u00EDo.
J0106=Error\: {0} con Formato incorrecto.
J0107=Error\: {0} inv\u00E1lido.
J0108=Error\: {0} con logitud incorrecto.
J0109=Error\: Dato de fecha de nacimiento irreal
J0110=Error\: Este tipo de acci\u00F3n (Con Mensaje) no es v\u00E1lida para la confirmaci\u00F3n de operaciones
J0111=Error\: Este tipo de acci\u00F3n (Con Mensaje) no es v\u00E1lida para el cambio de estado a enviada

J0112=Error\: Formato del RFC para personas f\u00EDsicas es incorrecto, debe de tener 10 o 13 posiciones y cumplir con el formato del SAT
J0113=Error\: Formato de la Clave de Elector es incorrecto, debe de tener 18 posiciones y cumplir con el formato v\u00E1lido
J0114=Error: Es necesario adjuntar el archivo del comprobante del documento de identidad
J0115=Error\: El identificador MILA del inversionista no es correcto, debe ser de 10 posiciones num\u00E9rico
J0116=Error: Formato del RFC para personas morales es incorrecto, debe de tener 12 posiciones y cumplir con el formato del SAT

#eventos corporativos
J0117=Debe insertar un Tipo de valor.
J0118=Debe insertar una Emisora.
J0119=Debe insertar un n\u00FAmero de serie.
J0120=Debe insertar un Isin.
J0121=Debe seleccionar un Tipo de Evento.
J0122=Debe seleccionar un Custodio.
J0123=Debe agregar una descripci\u00F3n en el cuerpo del Evento.
J0124=Debe agregar una descripci\u00F3n en el Pie del Evento.
J0125=Debe insertar una fecha de creaci\u00F3n.

#W8 BENE
J0130=Error: Para Personas Morales extranjeras de EUA solo puedes escoger Corporation.
J0131=Error: {0} es requerido.
J0132=Error: Para Afore-Siefore solo puedes escoger Tax-exempt organization.
J0133=Error\: {0} debe elegir solamente una opci\u00F3n.
J0134=Error: Para Fideicomiso complejo solo puedes escoger Complex trust.
J0135=Error\: {0} debe ser vac\u00EDo.
J0136=Error: Para Fideicomiso simple solo puedes escoger Nonwithholding foreign simple trust.
J0137=Error: Para Intermediario calificado solo puedes escoger Qualified intermediary.
J0138=Error\: {0} debe ser mayor o igual a cero (0).
J0139:Error: {0} El patr\u00F3n num\u00E9rico es ###.##
J0140:Error: {0} Valor fuera del rango permitido 0.00 - 100.00

J0141=Error al Asignar la B\u00F3veda a las Emisiones.
J0142=Error: No existe Relaci\u00F3n Emisi\u00F3n - B\u00F3veda.
J0143=Error: Al actualizar la B\u00F3veda a las Emisiones.
J0144=Error: Al actualizar la B\u00F3veda a la Relaci\u00F3n Emisi\u00F3n - B\u00F3veda.
J0145=Error: La fecha de liquidaci\u00F3n no debe ser menor a 7 d\u00EDas h\u00E1biles de la fecha actual.
J0146=Error: No se encontraron Depositantes/Liquidadores!

#Mensaje para la carga de estatus de beneficiarios
J0147=Error: El Beneficiario {0} ya tiene el estatus {1}.
J0148=Error: El Beneficiario ya fue eliminado
J0149=Error: No puede actualizarse de un estatus {0} a {1}.

J9998=Error\: El objeto Custodio , tiene un valor NULL o vac\u00EDo.


J9999=No se han encontrado registros coincidentes para los criterios de b\u00FAsqueda seleccionados.

errorParametroObligatorio = Error: Debe capturar al menos un criterio de b\u00FAsqueda para realizar la consulta.
errorCriteriosBusqueda = Error: Uno o m\u00e1s de los criterios de b\u00FAsqueda es incorrecto.
errorRangoFechas = Error: La diferencia entre las fechas de inicio y fin no debe ser mayor a 90 d\u00EDas.
errorFechaInicialMayorFechaFinal = Error: La fecha inicial no debe ser mayor a la fecha final.

#Mensaje de error de custodio inhabilitado
J0150=Error\: {0} no esta habilitado.

#Mensaje error UOI ya existe
J0151=Error: El UOI generado {0} ya existe.